## Panda Series

In [1]:
import pandas as  pd

In [4]:
dict = {"a": 3,"b":34, "c":"auku",'d':'de32'}
dict

{'a': 3, 'b': 34, 'c': 'auku', 'd': 'de32'}

In [5]:
dict = pd.Series(dict)
dict

a       3
b      34
c    auku
d    de32
dtype: object

In [6]:
dict.loc['c']

'auku'

In [13]:
dict.loc[['c']]

c    auku
dtype: object

## DataFrames

In [22]:
dict = {"a":pd.Series([234,345,123],index = ['bingo','singo','mingo']),
        "b":pd.Series([234,123,125],index = ['asd','adas','asdad'])}
print(dict)

{'a': bingo    234
singo    345
mingo    123
dtype: int64, 'b': asd      234
adas     123
asdad    125
dtype: int64}

In [25]:
type(dict)

dict

In [23]:
df = pd.DataFrame(dict)

In [26]:
df,type(df)

(           a      b
 adas     NaN  123.0
 asd      NaN  234.0
 asdad    NaN  125.0
 bingo  234.0    NaN
 mingo  123.0    NaN
 singo  345.0    NaN, pandas.core.frame.DataFrame)

In [27]:
df.index # list index values

Index(['adas', 'asd', 'asdad', 'bingo', 'mingo', 'singo'], dtype='object')

In [29]:
df.columns # column names

Index(['a', 'b'], dtype='object')

In [34]:
pd.DataFrame(df,index =[0,1],columns = ['a'])

    a
0 NaN
1 NaN

## Read excel file

In [35]:
import os

In [37]:
os.getcwd()

'C:\\Users\\satya\\Desktop\\python\\Python for data analysis'

In [49]:
file = r"C:\\Users\\satya\\Desktop\\python\\Python for data analysis\\scriptsLecture\\section4\\boston1.xls"

#load spreadsheet

x1 = pd.ExcelFile(file)

# print sheet name
print(x1.sheet_names)

['Sheet1', 'Sheet2']

In [50]:
# load sheet into dataframe by name : df1

df1 = x1.parse('Sheet1')
df1
df2 = x1.parse('Sheet2')
df2

      MV  INDUS   NOX     RM  TAX    PT  LSTAT
0   24.0   2.31  53.8  6.575  296  15.3   4.98
1   21.6   7.07  46.9  6.421  242  17.8   9.14
2   34.7   7.07  46.9  7.185  242  17.8   4.03
3   33.4   2.18  45.8  6.998  222  18.7   2.94
4   36.2   2.18  45.8  7.147  222  18.7   5.33
5   28.7   2.18  45.8  6.430  222  18.7   5.21
6   22.9   7.87  52.4  6.012  311  15.2  12.43
7   27.1   7.87  52.4  6.172  311  15.2  19.15
8   16.5   7.87  52.4  5.631  311  15.2  29.93
9   18.9   7.87  52.4  6.004  311  15.2  17.10
10  15.0   7.87  52.4  6.377  311  15.2  20.45

In [52]:
df1

,MV,INDUS,NOX,RM,TAX,PT,LSTAT,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,24.0,2.31,53.8,6.575,296,15.3,4.98,NaN,NaN,Subset of Boston housing tract
1,21.6,7.07,46.9,6.421,242,17.8,9.14,NaN,NaN,data of Harrison and Rubinfeld
2,34.7,7.07,46.9,7.185,242,17.8,4.03,NaN,NaN,(1978). Each case is one U.S.
3,33.4,2.18,45.8,6.998,222,18.7,2.94,NaN,NaN,Census tract in the Boston area.
4,36.2,2.18,45.8,7.147,222,18.7,5.33,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
501,22.4,11.93,57.3,6.593,273,21.0,9.67,NaN,NaN,NaN
502,20.6,11.93,57.3,6.120,273,21.0,9.08,NaN,NaN,NaN
503,23.9,11.93,57.3,6.976,273,21.0,5.64,NaN,NaN,NaN
504,22.0,11.93,57.3,6.794,273,21.0,6.48,NaN,NaN,NaN
505,11.9,11.93,57.3,6.030,273,21.0,7.88,NaN,NaN,NaN

In [54]:
## Reading Json - javascript object notation file
Json_file = pd.read_json(r"C:\Users\satya\Desktop\python\Python for data analysis\scriptsLecture\section4\skorea.json")

In [57]:
Json_file.head(4)

,Description,Image,Criteria,Site,Area ha (acre),Location,Year
0,,/wiki/File:MuryeongsTomb.jpg,Cultural: (ii)(iii),Baekje Historic Areas,135 (330),"South Chungcheong, North Jeolla",2015
1,,/wiki/File:Korea-Gwangju-Gochang_Dolmens_5350-...,Cultural: (iii),"Gochang, Hwasun and Ganghwa Dolmen Sites",,"Incheon, North Jeolla, South Jeolla",2000
2,,"/wiki/File:Juhamnu,_Changdeokgung_-_Seoul,_Kor...",Cultural: (ii)(iii)(iv),Changdeokgung Palace Complex,,Seoul,1997
3,,/wiki/File:Korea-Gyeongju-Bunhwangsa-Lanterns-...,Cultural: (ii)(iii),Gyeongju Historic Areas,"2,880 (7,100)",North Gyeongsang,2000

In [62]:
## Reading Text file
Text_file = pd.read_csv(r'C:\Users\satya\Desktop\python\Python for data analysis\scriptsLecture\section4\bostonTxt.txt',sep='\t')

In [63]:
Text_file

       MV  INDUS   NOX     RM  TAX    PT  LSTAT
0    24.0   2.31  53.8  6.575  296  15.3   4.98
1    21.6   7.07  46.9  6.421  242  17.8   9.14
2    34.7   7.07  46.9  7.185  242  17.8   4.03
3    33.4   2.18  45.8  6.998  222  18.7   2.94
4    36.2   2.18  45.8  7.147  222  18.7   5.33
..    ...    ...   ...    ...  ...   ...    ...
501  22.4  11.93  57.3  6.593  273  21.0   9.67
502  20.6  11.93  57.3  6.120  273  21.0   9.08
503  23.9  11.93  57.3  6.976  273  21.0   5.64
504  22.0  11.93  57.3  6.794  273  21.0   6.48
505  11.9  11.93  57.3  6.030  273  21.0   7.88

[506 rows x 7 columns]

## Reading HTML Files

In [64]:
import html5lib

In [98]:
Lois = pd.read_html("https://en.wikipedia.org/wiki/Lists_of_countries_and_territories")

In [101]:
Lois[4]

,vteLists of countries by energy rankings,vteLists of countries by energy rankings.1
0,Non-renewable energy,Petroleum Proven reserves Production Consumpti...
1,Renewable energy,Hydroelectricity Wind Solar Geothermal
2,Electric energy,Consumption Exports Imports Production
3,Total energy,Consumption and production per capita Intensit...
4,List of international rankings List of top int...,List of international rankings List of top int...